# напишіть функцію, що приймає два числа int і 
# повертає True якщо це квадрат, якщо ні - False 

# код від Яллін Олексій
# оголошення функціоналу програми:
print("Вітаю! Робимо перевірку КВАДРАТу за двома сторонами.")
# використовуємо бескінечний цикл на все тіло програми:
while True:
    nums_1, nums_2 = input("Введіть перше число: "), input("Ведіть друге число: ")  # приймаємо значення від користувача
    try:
        num_1 = int(nums_1) # перетворюємо введене значення в число
        num_2 = int(nums_2) # перетворюємо введене значення в число
    except:
        print("Ви ввели не числа! Тому за розрахунок буде прийнято кількість символів.")
        num_1 = len(nums_1) # приймаємо за число кількість введених символів
        num_2 = len(nums_2) # приймаємо за число кількість введених символів
    # користувацька функція порівняння двох чисел:
    def is_KVD(size_1, size_2):
        result = size_1 == size_2
        if result:  # задаємо текст для виводу при значенях True або False
            return "З такими сторонами КВАДРАТ ІСНУЄ."
        return "Нажаль, з такими числами отримаємо прямокутник, а НЕ КВАДРАТ."
    print(is_KVD(num_1, num_2))
    # дізнаємось, чи продовжувати наш бескінечний цикл:
    next = input("Якщо бажаєте спробувати ще, введіть Y: ")
    if next == "Y" or next == "y": # перевірка на введене значення
        next = True
    else:
        break   # зупинка бескінечного циклу
print("Всього найкращого!")

# напишіть...